<?php

return [

    'resume' => "ได้โปรดอ่านข้อมูลข้อความจากรูปภาพรวมถึง PDF ที่ส่งให้ ซึ่งอาจจะเป็น PDF ที่สร้างจากรูปภาพ
                \n\nในหัวข้อ skills ถ้าไม่มีหัวข้อที่เกี่ยวกับ skill ที่ชัดเจนก็ไม่ต้องส่งข้อมูลมาอย่าเอาข้อมูลจาก work_experience มาใส่
                \n\nโปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย
                ",

    'idcard' => "โปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย
                \n\nอะไรที่อ่านไม่รู้เรื่องให้ return null ที่หัวนั้น
                \n\nโปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย
    ",
    
    'transcript' => "โปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย
                \n\nอะไรที่อ่านไม่รู้เรื่องให้ return null ที่หัวนั้น
                \n\nอาจจะมีมากกว่า 1 เอกสาร โดยมากเนื้อหาจะต่อเนื่อง ส่วน GPA ให้เอาที่เป็น GPA เฉลี่ยของทั้งหมดเท่านั้น
                \n\nโปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย
    ",
];
