<?php

return [

    'resume' => "ได้โปรดอ่านข้อมูลข้อความจากรูปภาพรวมถึง PDF ที่ส่งให้ ซึ่งอาจจะเป็น PDF ที่สร้างจากรูปภาพ
                \n\nในหัวข้อ skills ถ้าไม่มีหัวข้อที่เกี่ยวกับ skill ที่ชัดเจนก็ไม่ต้องส่งข้อมูลมาอย่าเอาข้อมูลจาก work_experience มาใส่
                \n\nโปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย",

    'idcard' => "โปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย
                \n\nอะไรที่อ่านไม่รู้เรื่องให้ return null ที่ key นั้น
                \n\nอ่านที่อยู่ และตรวจสอบกับข้อมูลจังหวัด–อำเภอ–ตำบล จริงแหล่งข้อมูลไหนก็ได้ หากสะกดผิดหรือคลาดเคลื่อนให้ปรับให้ถูกต้องก่อนส่งออก",

    'transcript' => "โปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย
                \n\nอะไรที่อ่านไม่รู้เรื่องให้ return null ที่หัวนั้น
                \n\nอาจจะมีมากกว่า 1 เอกสาร โดยมากเนื้อหาจะต่อเนื่อง ส่วน GPA ให้เอาที่เป็น GPA เฉลี่ยของทั้งหมดเท่านั้น
                \n\nส่งข้อความทุกอย่างมาด้วยภาษาหลักของเอกสารเท่านั้น ถ้าเป็นอังกฤษให้ใช้รูปแบบ strtolower",
    'bookbank' => "โปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย
                \n\nอะไรที่อ่านไม่รู้เรื่องให้ return null ที่ key นั้น
                \n\nให้ถือว่าสมุดบัญชีเงินฝากแบบอิเล็กทรอนิกส์ check = yes",
    'another' => "ผมได้ส่งเอกสารหลายฉบับพร้อมกัน กรุณาประมวลผลแต่ละเอกสารแยกกัน และส่งผลลัพธ์เป็น JSON\n  
                ตามโครงสร้างตามนี้\n
                1. 'doc_type' ใช้ ประเภทของเอกสารนั้นใช้คำที่เป็นคำกลางๆ เช่น ใบรับรอง, ทะเบียนสมรส เป็นต้น 
                2. 'data' เป็น string โดยแบ่งเป็นหัวข้อ เขียนแบบ -หัวข้อ : รายละเอียด เอาบางข้อมูลที่สำคัญจริงๆ\n
                3. 'date_of_issue' จะต้องเป็นค่าสตริงของวันออกเอกสาร ในรูปแบบ YYYY-MM-DD (ค.ศ. เท่านั้น)\n
                4. 'date_of_expiry' จะต้องเป็นค่าสตริงของวันออกเอกสาร ในรูปแบบ YYYY-MM-DD (ค.ศ. เท่านั้น)\n
                กรุณาดึงข้อมูลแยกเอกสารตามโครงสร้างและจัดโครงสร้าง JSON ให้ตรงตามคำสั่งนี้อย่างเคร่งครัด.",

];
