<?php

return [

    'resume' => "ได้โปรดอ่านข้อมูลข้อความจากรูปภาพรวมถึง PDF ที่ส่งให้ ซึ่งอาจจะเป็น PDF ที่สร้างจากรูปภาพ
                \n\nในหัวข้อ skills ถ้าไม่มีหัวข้อที่เกี่ยวกับ skill ที่ชัดเจนก็ไม่ต้องส่งข้อมูลมาอย่าเอาข้อมูลจาก work_experience มาใส่
                \n\nโปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย",

    'idcard' => "โปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย
                \n\nอะไรที่อ่านไม่รู้เรื่องให้ return null ที่ key นั้น
                \n\nอ่านที่อยู่ และตรวจสอบกับข้อมูลจังหวัด–อำเภอ–ตำบล จริงแหล่งข้อมูลไหนก็ได้ หากสะกดผิดหรือคลาดเคลื่อนให้ปรับให้ถูกต้องก่อนส่งออก",
    'transcript' => "ถ้ามีการส่งเอกสารพร้อมกันหลายไฟล์ กรุณาประมวลผลเอกสารแต่ละไฟล์แยกกัน 1ไฟล์ ต่อ 1 เอกสาร และส่งผลลัพธ์เป็น JSON รวมถึงรักษาโครงสร้างนี้ไว้แม้จะมีแค่เอกสารเดียว\n  
                ตามโครงสร้างตามนี้\n
                1. prefix_name: (string) คำนำหน้าชื่อ\n
                2. name: (string) ชื่อนักศึกษา\n
                3. last_name: (string) นามสกุลนักศึกษา\n
                4. institution: (string) ชื่อเต็มสถาบัน/มหาวิทยาลัย\n
                5. degree: (string) ชื่อเต็มวุฒิการศึกษา\n
                6. education_level: (string) ระดับการศึกษา ถ้าเอกสารเป็น Eng ให้ใช้ Eng\n
                7. faculty: (string) ชื่อเต็มคณะวิชา\n
                8. major: (string) ชื่อเต็มสาขาวิชา/วิชาเอก\n
                9. minor: (string) หรือ null สำหรับวิชาโท (ใส่ null ถ้าไม่มี)\n
                10. date_of_admission: (string) ปีที่เข้าศึกษา (ใช้รูปแบบ YYYY-MM-DD หรือ ปี ค.ศ.เท่านั้น)\n
                11. date_of_graduation: (string) ปีที่สำเร็จการศึกษา (ใช้รูปแบบ YYYY-MM-DD ปี ค.ศ. เท่านั้น)\n
                12. gpa: (number) เกรดเฉลี่ยสะสม (เป็นตัวเลขทศนิยมเท่านั้น)\n
                13. check: (string) ตอบ yes ถ้าเป็น Transcript หรือ no ถ้าไม่ใช่\n
                ถ้าเอกสารเป็นภาษาไทย ให้ใช้ภาษาไทยทั้งหมด ถ้าเอกสารเป็นภาษาอังกฤษให้ใช้ตัวแรกเป็นตัวพิมพ์ใหญ๋",
    'military' => "โปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย
                \n\nบางทีสัสดีจะเขียนด้วยตัวเลขไทยด้วยมือ ให้แปลงเป็นเลขอารบิก",
    'marital' => "โปรดดึงข้อมูลทั้งหมดตามที่ร้องขอและสร้างเป็น JSON object ตามโครงสร้างที่กำหนด และอย่างส่งข้อมูลที่มี key ซ้ำกัน รวมถึง value ด้วย",
    'certificate' => "ผมได้ส่งเอกสารพร้อมกันหลายไฟล์ กรุณาประมวลผลเอกสารแต่ละไฟล์แยกกัน 1ไฟล์ ต่อ 1 เอกสาร และส่งผลลัพธ์เป็น JSON รวมถึงรักษาโครงสร้างนี้ไว้แม้จะมีแค่เอกสารเดียว\n  
                ตามโครงสร้างตามนี้\n
                1. 'name' ชื่อของใบ Certificate เอาตรงจุดที่โดดเด่นที่ดูเป็นชื่อใบประกาศ\n
                2. 'institutes สถาบันที่ออกใบ Certificate\n
                3. 'duration' ระยะเวลาในการอบรม ถ้าไม่มีก็ไม่ต้องรีเทริน\n
                4. 'date' จะต้องเป็นค่าสตริงของวันออกเอกสาร ในรูปแบบ YYYY-MM-DD (ค.ศ. เท่านั้น)\n
                5. check: (string) ตอบ yes ถ้าเป็น certificate หรืออาจจะเป็นเอกสารประเภทวุฒิบัตร ใบประกาศนียบัตรต่างๆ หากวิเคราะห์ว่าไม่ใช่ก็ตอบ no\n
                กรุณาดึงข้อมูลแยกเอกสารตามโครงสร้างและจัดโครงสร้าง JSON ให้ตรงตามคำสั่งนี้อย่างเคร่งครัด.",
    'another' => "ผมได้ส่งเอกสารพร้อมกันหลายไฟล์ กรุณาประมวลผลเอกสารแต่ละไฟล์แยกกัน 1ไฟล์ ต่อ 1 เอกสาร และส่งผลลัพธ์เป็น JSON รวมถึงรักษาโครงสร้างนี้ไว้แม้จะมีแค่เอกสารเดียว\n  
                ตามโครงสร้างตามนี้\n
                1. 'doc_type' ใช้ ประเภทของเอกสารนั้นใช้คำที่เป็นคำกลางๆ เช่น ใบรับรอง, ทะเบียนสมรส เป็นต้น 
                2. 'data' เป็น string โดยแบ่งเป็นหัวข้อ เขียนแบบ -หัวข้อ : รายละเอียด เอาบางข้อมูลที่สำคัญจริงๆ\n
                3. 'date_of_issue' จะต้องเป็นค่าสตริงของวันออกเอกสาร ในรูปแบบ YYYY-MM-DD (ค.ศ. เท่านั้น)\n
                4. 'date_of_expiry' จะต้องเป็นค่าสตริงของวันออกเอกสาร ในรูปแบบ YYYY-MM-DD (ค.ศ. เท่านั้น)\n
                กรุณาดึงข้อมูลแยกเอกสารตามโครงสร้างและจัดโครงสร้าง JSON ให้ตรงตามคำสั่งนี้อย่างเคร่งครัด.",

];
