<?php
return [
    'prefix_name' => [
        'นาย'=>'นาย',
        'นาง'=>'นาง',
        'นางสาว'=>'นางสาว',
    ],
    'prefix_name_en' => [
        'Mr.'=>'Mr.',
        'Mrs.'=>'Mrs.',
        'Miss'=>'Miss',
    ],

    'marital_status' => [
        'โสด'=>'โสด',
        'สมรส'=>'สมรส',
        'หย่าร้าง'=>'หย่าร้าง',
    ],

    'day' => [
        'Saturday' => 'วันเสาร์',
        'Sunday' => 'วันอาทิตย์',
        'monday' => 'วันจันทร์',
        'Tuesday' => 'วันอังคาร',
        'Wednesday' => 'วันพุธ',
        'Thursday' => 'วันพฤหัส',
        'Friday' => 'วันศุกร์',
    ],

    'job_status' => [
        'ปกติ' => 'ปกติ',
        'ยังไม่อนุมัติ' => 'ยังไม่อนุมัติ',
        'ถูกพักงาน' => 'ถูกพักงาน',
        'ออกแล้ว' => 'ออกแล้ว',
    ],

    'row' => [
        '1' => 'Admin',
        '2' => 'Officer',
        '3' => 'Employee',
    ],

    'education_level' => [
        'มัธยมศึกษาปีที่3' => 'มัธยมศึกษาปีที่3',
        'มัธยมศึกษาปีที่6' => 'มัธยมศึกษาปีที่6',
        'ปวช.' => 'ปวช.',
        'ปวส.' => 'ปวส.',
        'ปริญญาตรี' => 'ปริญญาตรี',
        'ปริญญาโท' => 'ปริญญาโท',
        'ปริญญาเอก' => 'ปริญญาเอก',
        'อื่นๆ (โปรดระบุ)' => 'อื่นๆ (โปรดระบุ)'
    ],

    'lang'=>[ 
        'ภาษาอังกฤษ' => 'ภาษาอังกฤษ',
        'ภาษาญี่ปุ่น' => 'ภาษาญี่ปุ่น',
        'ภาษาจีน' => 'ภาษาจีน',
        'ภาษาเกาหลี' => 'ภาษาเกาหลี',
    ],

    'office'=>[ 
        'Excel' => 'Excel',
        'Power Point' => 'Power Point',
        'Word' => 'Word',
    ],

    'multimedia'=>[ 
        'Photoshop' => 'Photoshop',
        'Ilastrator' => 'Ilastrator',
        'Premier Pro' => 'Premier Pro',
        'After Effect' => 'After Effect',
    ],

    'program'=>[ 
        'HTML' => 'HTML',
        'CSS' => 'CSS',
        'Javascript' => 'Javascript',
        'PHP' => 'PHP',
        'Python' => 'Python',
    ],

    'month' => [
        1 => 'มกราคม',
        2 => 'กุมภาพันธ์',
        3 => 'มีนาคม',
        4 => 'เมษายน',
        5 => 'พฤศภาคม',
        6 => 'มิถุนายน',
        7 => 'กรกฎาคม',
        8 => 'สิงหาคม',
        9 => 'กันยายน',
        10 => 'ตุลาคม',
        11 => 'พฤศจิกายน',
        12 => 'ธันวาคม',
    ],

    'time_policy' => [
        1 => 'ฝ่ายบริหาร',
        2 => 'ฝ่ายบุคคล',
        3 => 'ฝ่ายผลิต',
        4 => 'ฝ่าย IT',
        5 => 'ฝ่ายขาย',
        6 => 'ฝ่ายบัญชี',
        7 => 'ฝ่ายการตลาด',
    ],
    
    'doc_name' => [
        'resume' => 'เอกสาร Resume',
        'id_card' => 'สำเนาบัตรประชาชน',
        'transcript' => 'วุฒิการศึกษา',
    ],

];